pruebas/01065000000005520241002101546.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
<soapenv:Header/>
   <soapenv:Body>
      <siiLR:SuministroLRFacturasEmitidas>
         <sii:Cabecera>
            <sii:IDVersionSii>1.1</sii:IDVersionSii>
            <sii:Titular>
               <sii:NombreRazon>DIAGRAM SOFTWARE, S.L.</sii:NombreRazon>
               <sii:NIF>B53179768</sii:NIF>
            </sii:Titular>
            <sii:TipoComunicacion>A0</sii:TipoComunicacion>
         </sii:Cabecera>
         <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2018</sii:Ejercicio>
               <sii:Periodo>06</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B53179768</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>42</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>15-06-2018</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>484</sii:ImporteTotal>
               <sii:DescripcionOperacion>VENTAS</sii:DescripcionOperacion>
               <sii:Contraparte>
                  <sii:NombreRazon>APELLIDO APELLIDO, NOMBRE</sii:NombreRazon>
                  <sii:NIF>05100001G</sii:NIF>
               </sii:Contraparte>
               <sii:TipoDesglose>
                  <sii:DesgloseFactura>
                     <sii:Sujeta>
                        <sii:NoExenta>
                           <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                           <sii:DesgloseIVA>
                              <sii:DetalleIVA>
                                 <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                 <sii:BaseImponible>400</sii:BaseImponible>
                                 <sii:CuotaRepercutida>84</sii:CuotaRepercutida>
                              </sii:DetalleIVA>
                           </sii:DesgloseIVA>
                        </sii:NoExenta>
                     </sii:Sujeta>
                  </sii:DesgloseFactura>
               </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
         </siiLR:RegistroLRFacturasEmitidas>
         <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2018</sii:Ejercicio>
               <sii:Periodo>06</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B53179768</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>43</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>15-06-2018</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>1500</sii:ImporteTotal>
               <sii:DescripcionOperacion>N/FRA.</sii:DescripcionOperacion>
               <sii:Contraparte>
                  <sii:NombreRazon>APELLIDO APELLIDO, NOMBRE</sii:NombreRazon>
                  <sii:NIF>05100001G</sii:NIF>
               </sii:Contraparte>
               <sii:TipoDesglose>
                  <sii:DesgloseFactura>
                     <sii:Sujeta>
                        <sii:Exenta>
                           <sii:DetalleExenta>
                              <sii:CausaExencion>E1</sii:CausaExencion>
                              <sii:BaseImponible>1000</sii:BaseImponible>
                           </sii:DetalleExenta>
                           <sii:DetalleExenta>
                              <sii:CausaExencion>E2</sii:CausaExencion>
                              <sii:BaseImponible>500</sii:BaseImponible>
                           </sii:DetalleExenta>
                        </sii:Exenta>
                     </sii:Sujeta>
                  </sii:DesgloseFactura>
               </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
         </siiLR:RegistroLRFacturasEmitidas>
      </siiLR:SuministroLRFacturasEmitidas>
   </soapenv:Body>
</soapenv:Envelope>
